import ybc_ui
#把每个字母和摩斯电码使用字典一一对应起来
zimu = {
    "a": ".-",
    "b": "-...",
    "c": "-.-.",
    "d": "-..",
    "e": ".",
    "f": "..-.",
    "g": ".-",
    "h": "....",
    "i": "..",
    "j": ".---",
    "k": "-.-",
    "l": ".-..",
    "m": "--",
    "n": "-.",
    "o": "---",
    "p": ".--.",
    "q": "--.-",
    "r": ".-.",
    "s": "...",
    "t": "-",
    "u": "..-",
    "v": "...-",
    "w": ".--",
    "x": "-..-",
    "y": "-.--",
    "z": "--..",
}

ybc_ui.picker_button('在电力刚刚诞生的1837年，人们发明了摩斯电码。通过它，人类第一次能快速的将信息发送到千里之外了！', ['什么是摩斯电码？'])

ybc_ui.picker_button('摩斯电码，指的是将英文字母转换成‘.’和‘_’的不同组合，从而方便传输信息的编码方式。', ['现在有什么用处呢？'])

ybc_ui.picker_button('现在，人们经常会在侦探小说中看到摩斯电码，帅气的侦探用秘密电报传递信息！人们也会在遭遇危险时，使用摩斯电码快速将遇险信息告知他人。',['太酷啦，我也想试试！'])

#只能写单词哦
ask = ybc_ui.input("要翻译成摩斯电码的英文单词是: ")

length = len(ask)
output = ""

for i in range(length):
    if ask[i] in zimu.keys():
        output = output + " " + zimu.get(ask[i])

ybc_ui.message('单词' + ask + '转换成摩斯电码的结果为：\n' + output)
